{
  "Symbol": "MSFT",
  "AssetType": "Common Stock",
  "Name": "Microsoft Corporation",
  "Description": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. Its Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, as well as related Client Access Licenses (CAL); Skype, Outlook.com, and OneDrive; LinkedIn that includes Talent, Learning, Sales, and Marketing solutions, as well as premium subscriptions; and Dynamics 365, a set of cloud-based and on-premises business solutions for small and medium businesses, large organizations, and divisions of enterprises. Its Intelligent Cloud segment licenses SQL and Windows Servers, Visual Studio, System Center, and related CALs; GitHub that provides a collaboration platform and code hosting service for developers; and Azure, a cloud platform. It also offers support services and Microsoft consulting services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification to developers and IT professionals on various Microsoft products. Its More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; Windows Internet of Things; and MSN advertising. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other intelligent devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. It sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.",
  "Exchange": "NASDAQ",
  "Currency": "USD",
  "Country": "USA",
  "Sector": "Technology",
  "Industry": "SoftwareInfrastructure",
  "Address": "One Microsoft Way, Redmond, WA, United States, 98052-6399",
  "FullTimeEmployees": "163000",
  "FiscalYearEnd": "June",
  "LatestQuarter": "2020-06-30",
  "MarketCapitalization": "1569227800576",
  "EBITDA": "65258999808",
  "PERatio": "35.4219",
  "PEGRatio": "2.4285",
  "BookValue": "15.626",
  "DividendPerShare": "2.04",
  "DividendYield": "0.0098",
  "EPS": "5.76",
  "RevenuePerShareTTM": "18.793",
  "ProfitMargin": "0.3096",
  "OperatingMarginTTM": "0.3703",
  "ReturnOnAssetsTTM": "0.1126",
  "ReturnOnEquityTTM": "0.4014",
  "RevenueTTM": "143015002112",
  "GrossProfitTTM": "96937000000",
  "DilutedEPSTTM": "5.76",
  "QuarterlyEarningsGrowthYOY": "-0.142",
  "QuarterlyRevenueGrowthYOY": "0.128",
  "AnalystTargetPrice": "228.71",
  "TrailingPE": "35.4219",
  "ForwardPE": "31.25",
  "PriceToSalesRatioTTM": "10.9608",
  "PriceToBookRatio": "13.0514",
  "EVToRevenue": "10.3381",
  "EVToEBITDA": "21.6082",
  "Beta": "0.8935",
  "52WeekHigh": "232.86",
  "52WeekLow": "132.52",
  "50DayMovingAverage": "212.6977",
  "200DayMovingAverage": "188.2425",
  "SharesOutstanding": "7567649792",
  "SharesFloat": "7455727348",
  "SharesShort": "43132952",
  "SharesShortPriorMonth": "42930465",
  "ShortRatio": "1.08",
  "ShortPercentOutstanding": "0",
  "ShortPercentFloat": "0.0049",
  "PercentInsiders": "1.425",
  "PercentInstitutions": "74.093",
  "ForwardAnnualDividendRate": "2.04",
  "ForwardAnnualDividendYield": "0.0098",
  "PayoutRatio": "0.3455",
  "DividendDate": "2020-09-10",
  "ExDividendDate": "2020-08-19",
  "LastSplitFactor": "2:1",
  "LastSplitDate": "2003-02-18"
}